tap "1password/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "oven-sh/bun"
tap "railwaycat/emacsmacport"
brew "jpeg-xl"
brew "bat"
brew "colordiff"
brew "curl"
brew "php"
brew "composer"
brew "deno"
brew "exa"
brew "fzf"
brew "gh"
brew "git"
brew "go"
brew "mas"
brew "mysql", restart_service: true
brew "neovim", args: ["HEAD"]
brew "node"
brew "phpunit"
brew "plantuml"
brew "ripgrep"
brew "rust"
brew "starship"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "oven-sh/bun/bun"
brew "railwaycat/emacsmacport/emacs-mac", link: false
cask "1password"
cask "1password-cli"
cask "deepl"
cask "docker"
cask "font-hack-nerd-font"
cask "font-hackgen"
cask "font-hackgen-nerd"
cask "gimp"
cask "google-chrome"
cask "google-drive"
cask "iterm2"
cask "jetbrains-toolbox"
cask "keyboardcleantool"
cask "logi-options-plus"
cask "notion"
cask "obsidian"
cask "phpstorm"
cask "raindropio"
cask "raycast"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "vivaldi"
cask "zoom"
mas "Kindle Classic", id: 405399194
mas "LINE", id: 539883307
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "RunCat", id: 1429033973
vscode "MS-CEINTL.vscode-language-pack-ja"
