tap "1password/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "railwaycat/emacsmacport"
brew "jpeg-xl"
brew "colordiff"
brew "curl"
brew "php"
brew "composer"
brew "exa"
brew "gh"
brew "git"
brew "mas"
brew "mysql", restart_service: true
brew "neovim", args: ["HEAD"]
brew "node"
brew "plantuml"
brew "ripgrep"
brew "starship"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "railwaycat/emacsmacport/emacs-mac", link: false
cask "1password-cli"
cask "alfred"
cask "amazon-music"
cask "deepl"
cask "docker"
cask "emacs-mac"
cask "font-hack-nerd-font"
cask "font-hackgen"
cask "font-hackgen-nerd"
cask "gimp"
cask "google-chrome"
cask "google-drive"
cask "iterm2"
cask "keyboardcleantool"
cask "notion"
cask "obsidian"
cask "phpstorm"
cask "raycast"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "zoom"
mas "Kindle", id: 405399194
mas "LINE", id: 539883307
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "RunCat", id: 1429033973
vscode "foam.foam-vscode"
vscode "marp-team.marp-vscode"
vscode "MS-CEINTL.vscode-language-pack-ja"
vscode "mushan.vscode-paste-image"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "yzhang.markdown-all-in-one"
